const React = require('react');
const Layout = require('./Layout');

module.exports = function Shablon({ userSession }) {
  return (
    <Layout userSession={userSession}>
      {/* <script defer src="js/registration.js" /> */}
      <div className="shablon">
       <div className='greetings'>
       Привет, {'employee'} <br />
       И добро пожаловать в команду Высокогорья!<br />
       Впереди нас ждет интересное путешествие в мир нашей<br /> компании, и самым главным проводником будет- {'userId'}<br />
       Мы подготовили для тебя чек-лист на первый день. Процесс<br />
       выполнения будет сохраняться, поэтому ты можешь закрывать пункты<br />
       в удобном для тебя порядке.
       </div>
       <div>
       Нужно подготовить твое рабочее место:<br />
    • Наставник выдал мне пропуск
    • Наставник сообщил пароль от Wi-Fi 
    • Системный администратор выдал мне ноутбук
    • Системный администратор выдал мне доступы к почте
    • Ты отправил(-а) офис-менеджеру на почту список необходимой для тебя канцелярии

Важно познакомиться с коллегами:
    • Ты познакомился (-ась) со своим руководителем
    • Ты написал(-а) сообщение в командный чат
    • Напиши имена трех твоих коллег по отделу: ____________

Важно пройти оформление в отделе кадров:
    • Ты отправил (-а)  сканды документы на оформление в отдел кадров
    • Ты подписал (-а) соглашение о коммерческой тайне

А теперь самое время работать:
    • Получи свою первую задачу у руководителя
    • Создай подпись в почте по корпоративному шаблону


Классного путешествия!
Команда Высокой горы 💚
       </div>
      </div>
    </Layout>
  );
};
// Привет, Имя Фамилия! 
// И добро пожаловать в команду Высокогорья!
// Впереди нас ждет интересное путешествие в мир нашей компании, и самым главным проводником будет- Имя Фамилия
// Мы подготовили для тебя чек-лист на первый день. Процесс выполнения будет сохраняться, поэтому ты можешь закрывать пункты в удобном для тебя порядке.

